# running in ../sby_config/wb_interconnect_basic/src/
read -formal wb_interconnect.sv
hierarchy -check -top wb_interconnect
prep -top wb_interconnect

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
