# running in ../sby_config/cpu_wb_imem_master_prove_task1/src/
read -formal cpu_wb_imem_master.sv
hierarchy -check -top cpu_wb_imem_master
prep -top cpu_wb_imem_master

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
